#+TITLE: Knuth先生の『TAOCP 7.2.2.2 Satisfiability』を読む
#+AUTHOR: 田村直之

* 簡単な例 (A simple example)

$\textit{waerden}(3,3;9)$ が充足不能 (unsat)であることを，
入力ファイル [[../prog/waerden-3-3-9.sat][waerden-3-3-9.sat]] を用いて確かめる．
#+BEGIN_SRC ipython :session
! sat13 < waerden-3-3-9.sat
#+END_SRC

$\textit{waerden}(j,k;n)$ のCNF式を出力するプログラムは [[../knuth/pdf/sat-waerden.pdf][sat-waerden]] である．
#+BEGIN_SRC ipython :session
! sat-waerden 3 3 8
#+END_SRC

bashのパイプ (~|~)を用いて，以下のようにすれば sat13 の入力として与えることができる．
#+BEGIN_SRC ipython :session
! sat-waerden 3 3 8 | sat13
#+END_SRC

Scala版のプログラムを利用する場合は以下のようになる．
#+BEGIN_SRC ipython :session
! ./taocpsat waerden 3 3 8 | sat13
#+END_SRC

$(j,k,n)=(4,4,34)$ の解を探してみる．
#+BEGIN_SRC ipython :session
(j,k,n) = (4,4,34)
! sat-waerden $j $k $n | sat13
#+END_SRC

SATソルバーの結果からは，すぐにはどのような解が得られたのかがわからない．
Linuxのコマンドと組み合わせるなら以下のようにできる．
#+BEGIN_SRC ipython :session
# k,j,n を定義
(j,k,n) = (4,4,34)
! sat-waerden $j $k $n | sat13 | tr ' ' '\n' | grep -v '^~' | sort -n
#+END_SRC

Pythonのプログラムと組み合わせるなら以下のようにできる．
#+BEGIN_SRC ipython :session
(j,k,n) = (4,4,34)
# SATソルバーを実行しその結果を変数 result に代入する．標準エラー出力は別のファイルに保存してから表示している．
result = ! sat-waerden $j $k $n | sat13 2>/tmp/err
! cat /tmp/err
# result の最初の行を空白区切りで分割して"~"のついていないものだけ取り出し，変数 model に代入する．
model = [ lit for lit in result[0].strip().split(" ") if not lit.startswith("~") ]
# 整数のリストに変換しソートして表示する
nums = [ int(x) for x in model ]
nums.sort()
nums
#+END_SRC

#+RESULTS:
:results:
# Out [40]: 
# output
(34 variables, 352 clauses, 1408 literals successfully read)
!SAT!
Altogether 4857+141856 mems, 21974 bytes, 132 nodes, 77 clauses learned (ave 7.5->6.7), 3225 memcells.
(13 learned clauses were discarded.)
(3 clauses were subsumed on-the-fly.)
(25 restarts.)

# text/plain
: [2, 4, 5, 6, 10, 12, 13, 15, 16, 17, 21, 23, 24, 26, 27, 28, 32, 34]
:end:

